{
  "formal": {
    "preferred_signoff": "Best regards",
    "signature_format": "{sender_name}",
    "last_drafts": [
      "Subject: Temporary Connection Issue\n\nHi,\n\nThe AI service is temporarily unavailable due to a network issue. This is a fallback response to ensure the workflow continues.\n\nPlease try again in a moment.\n\nBest regards,\nEmail Assistant",
      "Subject: Temporary Connection Issue\n\nHi,\n\nThe AI service is temporarily unavailable due to a network issue. This is a fallback response to ensure the workflow continues.\n\nPlease try again in a moment.\n\nBest regards,\nEmail Assistant",
      "Subject: Temporary Connection Issue\n\nHi,\n\nThe AI service is temporarily unavailable due to a network issue. This is a fallback response to ensure the workflow continues.\n\nPlease try again in a moment.\n\nBest regards,\nEmail Assistant",
      "Subject: Application for [Job Title] Position\n\nDear Reni,\n\nI hope this message finds you well. I am writing to formally submit my CV for the [Job Title] position at Company, as discussed. I have attached my CV for your review and consideration.\n\nAdditionally, I would appreciate it if you could provide me with more details regarding the job description and any specific qualifications or skills that are particularly valued for this role. Understanding these aspects will help me better align my experience with the expectations of the position.\n\nThank you for your attention to my application. I look forward to your response.\n\nBest regards,  \nAnju",
      "Subject: CV Submission and Request for Job Description\n\nDear Reni,\n\nI hope this message finds you well. I am attaching my CV for your review and would appreciate it if you could provide more details regarding the job description for the position I am applying for at the company. Understanding the specific responsibilities and expectations will greatly assist me in aligning my qualifications with the role.\n\nThank you for your assistance. I look forward to your response.\n\nBest regards,  \nAnju"
    ]
  },
  "assertive": {
    "preferred_signoff": "Regards",
    "signature_format": "{sender_name}",
    "last_drafts": [
      "Subject: Request for Further Details on Job Description\n\nDear Reni,\n\nI am writing to express my interest in the position at Company and have attached my CV for your review.\n\nPlease provide me with more details about the job description. I need to understand the specific responsibilities and expectations associated with the role, as well as any key qualifications you are seeking.\n\nThank you for your assistance. I look forward to your prompt response.\n\nBest regards,  \nAnju",
      "Subject: Request for Feedback on Employee Performance\n\nDear Reni,\n\nI am reaching out to request your feedback on one of my employees, [Employee Name], who has been working under your supervision for the past few months. Your insights are essential in assessing their performance and identifying areas for improvement.\n\nPlease provide your observations regarding their strengths and any challenges they may be facing. Additionally, specific examples of their work would be greatly appreciated. Your feedback will play a crucial role in guiding their professional development.\n\nThank you for your attention to this matter. I look forward to your prompt response.\n\nBest regards,  \nAnju",
      "Subject: Request for Feedback on Employee Performance\n\nDear Reni,\n\nI am reaching out to request your feedback on Anju's recent performance. Your insights are essential in assessing her contributions and identifying areas for improvement.\n\nPlease provide your observations and any specific examples of her work over the past few months. This feedback will guide her professional growth and ensure she aligns with our company goals.\n\nThank you for your attention to this matter. I look forward to your prompt response.\n\nBest regards,  \nAnju"
    ]
  },
  "casual": {
    "preferred_signoff": "Cheers",
    "signature_format": "{sender_name}",
    "last_drafts": [
      "Subject: Request to Book a Movie Ticket\n\nHi Reni,\n\nI hope you’re doing well! I would like to request your assistance in booking a movie ticket for this weekend. Please let me know if you need any specific details or preferences from my side.\n\nThanks a lot for your help!\n\nCheers,  \nAnju",
      "Subject: Movie Plans for Saturday\n\nHi Reni,\n\nHope you're doing well! I was wondering if you'd like to catch a movie this Saturday. It would be great to hang out and enjoy some time together. Let me know what you think!\n\nLooking forward to hearing from you.\n\nCheers,  \nAnju",
      "Subject: Movie and Dinner Plans\n\nHi Reni,\n\nHope you’re doing well! I was wondering if you’d like to catch a movie this Saturday and grab dinner afterward. It would be great to hang out and enjoy some good food together.\n\nLet me know what you think!\n\nCheers,  \nAnju",
      "Subject: Movie and Dinner Plans for Saturday\n\nHi Reni,\n\nI hope you’re doing well! I was wondering if you’d like to catch a movie this Saturday and grab some dinner afterward. It’s been a while since we hung out, and I think it would be a great way to spend the evening together.\n\nLet me know what time works for you and if there’s a specific movie you’d like to see. I’m flexible with the dinner spot too, so feel free to suggest any place you have in mind!\n\nLooking forward to hearing from you!\n\nCheers,  \nAnju",
      "Subject: Movie and Dinner This Saturday?\n\nHi Reni,\n\nI hope you’re doing well! I was wondering if you’d like to catch a movie this Saturday and grab some dinner afterward. It’s been a while since we’ve had a fun outing together, and I think it would be a great way to unwind.\n\nThere are a few movies out that I’ve heard good things about. If you have any preferences, let me know! After the movie, we could try that new restaurant that just opened up or go to our favorite spot.\n\nLet me know what you think, and if you’re free, we can finalize the details. Looking forward to it!\n\nCheers,  \nAnju"
    ]
  }
}