{
  "formal": {
    "preferred_signoff": "Best regards",
    "signature_format": "{sender_name}",
    "last_drafts": [
      "Subject: Inquiry Regarding Opportunities and CV Submission\n\nDear Reni,\n\nI hope this message finds you in good health. I am writing to express my interest in potential opportunities within your esteemed company and to inquire about any current or upcoming positions that may align with my skills and experience.\n\nAttached to this email is my CV for your review. I would greatly appreciate any insights you could provide regarding suitable roles or the application process at your company.\n\nThank you for your time and consideration. I look forward to your response.\n\nBest regards,  \nAnju Reni",
      "Subject: Request for Detailed Job Description\n\nDear Reni,\n\nI hope this message finds you well.\n\nI am writing to express my interest in the position at your esteemed company and have attached my CV for your review. I would greatly appreciate it if you could provide me with a more detailed job description for the role. Understanding the specific responsibilities and expectations will enable me to better assess how my skills and experiences align with the position.\n\nThank you for your time and consideration. I look forward to your response.\n\nBest regards,  \nAnju Reni",
      "Subject: Request for Detailed Job Description and CV Submission\n\nDear Reni,\n\nI hope this message finds you well.\n\nI am writing to express my interest in the position at your esteemed company and have attached my CV for your review. I would greatly appreciate it if you could provide me with a more detailed job description, including the location of the position, as this information will assist me in understanding how my skills and experiences align with the role.\n\nThank you for considering my application. I look forward to your response.\n\nBest regards,  \nAnju Reni"
    ]
  },
  "assertive": {
    "preferred_signoff": "Regards",
    "signature_format": "{sender_name}",
    "last_drafts": []
  },
  "casual": {
    "preferred_signoff": "Cheers",
    "signature_format": "{sender_name}",
    "last_drafts": []
  }
}