{
  "formal": {
    "preferred_signoff": "Best regards",
    "signature_format": "{sender_name}",
    "last_drafts": [
      "Subject: Inquiry Regarding Opportunities and CV Submission\n\nDear Reni,\n\nI hope this message finds you in good health. I am writing to express my interest in potential opportunities within your esteemed company and to inquire about any current or upcoming positions that may align with my skills and experience.\n\nAttached to this email is my CV for your review. I would greatly appreciate any insights you could provide regarding suitable roles or the application process at your company.\n\nThank you for your time and consideration. I look forward to your response.\n\nBest regards,  \nAnju Reni",
      "Subject: Request for Detailed Job Description\n\nDear Reni,\n\nI hope this message finds you well.\n\nI am writing to express my interest in the position at your esteemed company and have attached my CV for your review. I would greatly appreciate it if you could provide me with a more detailed job description for the role. Understanding the specific responsibilities and expectations will enable me to better assess how my skills and experiences align with the position.\n\nThank you for your time and consideration. I look forward to your response.\n\nBest regards,  \nAnju Reni",
      "Subject: Request for Detailed Job Description and CV Submission\n\nDear Reni,\n\nI hope this message finds you well.\n\nI am writing to express my interest in the position at your esteemed company and have attached my CV for your review. I would greatly appreciate it if you could provide me with a more detailed job description, including the location of the position, as this information will assist me in understanding how my skills and experiences align with the role.\n\nThank you for considering my application. I look forward to your response.\n\nBest regards,  \nAnju Reni",
      "Subject: Request for Right-to-Represent Form Link\n\nDear Anju,\n\nI hope this message finds you well.\n\nI would like to express my gratitude for the opportunity to discuss the potential position with you. However, I noticed that the link to the right-to-represent form was not included in your previous email. Could you please forward the link at your earliest convenience? I would like to complete the necessary formalities as soon as possible.\n\nThank you for your assistance.\n\nBest regards,  \n[Your Name]"
    ]
  },
  "assertive": {
    "preferred_signoff": "Regards",
    "signature_format": "{sender_name}",
    "last_drafts": []
  },
  "casual": {
    "preferred_signoff": "Cheers",
    "signature_format": "{sender_name}",
    "last_drafts": [
      "Subject: Request to Book a Movie Ticket\n\nHi Reni,\n\nI hope you’re doing well! I would like to request your assistance in booking a movie ticket for this weekend. Please let me know if you need any specific details or preferences from my side.\n\nThanks a lot for your help!\n\nCheers,  \nAnju",
      "Subject: Movie Plans for Saturday\n\nHi Reni,\n\nHope you're doing well! I was wondering if you'd like to catch a movie this Saturday. It would be great to hang out and enjoy some time together. Let me know what you think!\n\nLooking forward to hearing from you.\n\nCheers,  \nAnju",
      "Subject: Movie and Dinner Plans\n\nHi Reni,\n\nHope you’re doing well! I was wondering if you’d like to catch a movie this Saturday and grab dinner afterward. It would be great to hang out and enjoy some good food together.\n\nLet me know what you think!\n\nCheers,  \nAnju",
      "Subject: Movie and Dinner Plans for Saturday\n\nHi Reni,\n\nI hope you’re doing well! I was wondering if you’d like to catch a movie this Saturday and grab some dinner afterward. It’s been a while since we hung out, and I think it would be a great way to spend the evening together.\n\nLet me know what time works for you and if there’s a specific movie you’d like to see. I’m flexible with the dinner spot too, so feel free to suggest any place you have in mind!\n\nLooking forward to hearing from you!\n\nCheers,  \nAnju",
      "Subject: Movie and Dinner This Saturday?\n\nHi Reni,\n\nI hope you’re doing well! I was wondering if you’d like to catch a movie this Saturday and grab some dinner afterward. It’s been a while since we’ve had a fun outing together, and I think it would be a great way to unwind.\n\nThere are a few movies out that I’ve heard good things about. If you have any preferences, let me know! After the movie, we could try that new restaurant that just opened up or go to our favorite spot.\n\nLet me know what you think, and if you’re free, we can finalize the details. Looking forward to it!\n\nCheers,  \nAnju"
    ]
  }
}